In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'M': ['foo', 'bar', 'foo', 'bar'],
                       'N': ['one', 'one', 'two', 'three'],
                       'O': np.random.randn(4),
                       'P': np.random.randn(4)})

In [3]:
df

     M      N         O         P
0  foo    one  1.112531 -0.821685
1  bar    one  0.930419  0.048056
2  foo    two  1.262608 -0.206174
3  bar  three  0.636304 -0.703841

Grouping and then applying the sum() function to the resulting groups.

In [4]:
df.groupby('M').sum()

            O         P
M
bar  1.566723 -0.655785
foo  2.375139 -1.027859

Grouping by multiple columns forms a hierarchical index, and again we can apply the sum function.

In [5]:
df.groupby(['M', 'N']).sum()

                  O         P
M   N
bar one    0.930419  0.048056
    three  0.636304 -0.703841
foo one    1.112531 -0.821685
    two    1.262608 -0.206174